Revit 2027 API
CanExecuteEventArgs.GetSelectedCategoryIds Method
Gets the category ids of selected elements.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> GetSelectedCategoryIds()
Public Function GetSelectedCategoryIds As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ GetSelectedCategoryIds()
member GetSelectedCategoryIds : unit -> ICollection<ElementId>
Return Value
ICollection<ElementId>
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace